app/controllers/cars_controller.rb

    def index
    cars = Car.includes(:photos).all
---
SELECT "cars".* FROM "cars"
SELECT "photos".* FROM "photos" WHERE "photos"."car_id" IN (?, ?, ?, ?, ?, ?, ?)  [["car_id", 1], ["car_id", 2], ["car_id", 3], ["car_id", 4], ["car_id", 5], ["car_id", 6], ["car_id", 7]]

    def show
      car = Car.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def create
      car = Car.new(car_params)
      if car.save
---
INSERT INTO "cars" ("make", "model", "year", "profile_image", "created_at", "updated_at", "availability") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
      @car = Car.find(params[:id])
      if @car.update(car_params)
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "cars" SET "make" = ?, "updated_at" = ?, "availability" = ? WHERE "cars"."id" = ?  [["make", "Impreza"], ["updated_at", "2023-10-19 15:10:29.902690"], ["availability", "available"], ["id", 2]]