app/controllers/photos_controller.rb

    def index
      photos = Photo.all
---
SELECT "photos".* FROM "photos"

    def create
        photo = Photo.new(photo_params)
        if photo.save
---
INSERT INTO "photos" ("car_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["car_id", 1], ["image", "https://example.com/toyota_camry_2022_photo2.jpg"], ["created_at", "2023-10-18 10:42:40.286376"], ["updated_at", "2023-10-18 10:42:40.286376"]]

    def update
      @photo = Photo.find(params[:id])
      if @photo.update(photo_params)
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "photos" SET "car_id" = ?, "image" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["car_id", 1], ["image", "https://carnationautomart.com/storage/images/YwQvuz6cMw6UOd4JqvioYQi5ivdkUBTeGBuGu5Hm.jpg"], ["updated_at", "2023-10-18 14:03:49.004553"], ["id", 5]]

    def destroy
      @photo = Photo.find(params[:id])
      @photo.destroy
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 9]]